# Άσκηση 5. Γράψτε ένα κώδικα σε Python ο οποίος να παίρνει τις διαστάσεις ενός ορθογωνίου και θα φτιάχνει μέσα από λίστες
# τον αντίστοιχο πίνακα. Στην συνέχεια θα βρίσκει το πλήθος των θέσεων και γεμίζει στην τύχη τις μισές με S και τις μισές
# με O (στρογγυλοποίηση προς τα πάνω). Σκοπός είναι να μετρήσετε πόσες φορές εμφανίζεται το SOS οριζόντια, κάθετα, και  
# διαγώνια. Το πρόγραμμα επαναλλαμβάνεται 100 φορές (για τις ίδιες διαστάσεις) και επιστρέφει τον μέσο όρο των τριάδων SOS.

import random

x = int(input("Δώσε το ύψος του ορθογωνίου: "))  
y = int(input("Δώσε την βάση του ορθογωνίου: "))
t = int(input("Πόσες επαναλήψεις θέλεις να γίνουν; "))  # Επιλογή από τον χρήστη. 


#if x > y:
#    z = x                     # Αντιμετάθεση τιμών.
#    x = y
#    y = z

d = x*y
suma = 0

if d % 2 != 0:                # (στρογγυλοποίηση προς τα πάνω).
    d += 1

for i in range(t):            # Επανάληψη για 100 φορές.
    
    P = []                    # Ο τελικός πίνακας.
    SOS = []
    for i in range(d//2): 
        SOS.append('S')
    for i in range(d//2):
        SOS.append('O')

################################################################################

# Γέμισμα του πίνακα
    L = []                             
    random.shuffle(SOS)
    for i in range(x):          # x
        for j in range(y):      # y
            L.append(SOS.pop())
        P.append(L)
        L = [] 
    print(P)
    
    A = ['S','O','S']
    s = []

###################################################################################################

# Horizontal Check!   OK!!!
    

    for lista in P:
        cnt = 0
        for i in range(y-2):        
            for j in range(cnt,3+cnt):
                s.append(lista[j])        
            cnt += 1
            print(s)
            if s == A:
                suma +=1
            s = []
    s = []
      
    print(suma)
    
    
###################################################################################################    

# Vertical Check!     OK!!!
    
    if x > 2:                               # Αν το ύψος x είναι μεγαλύτερο 2!!!
        for k in range(x-2):
            for i in range(y):              
                cnt = k                
                for j in range(cnt,3+cnt):   
                    s.append(P[cnt][i])     
                    cnt += 1                
                cnt = k                               
                print(s)  
                if s == A:
                    suma +=1
                s = []
    s = []
      
    print(suma)

###################################################################################################    

# Diagonial Check!  Left to Right OK!!! 
    
    if x > 2 and y > 2:                      # για x=4 τότε k==0, k==1.
        for k in range(x-2):
            cnt = 0                  
            for i in range(y-2):             # για y=6 τότε i==0, i==1, i==2, i==3.               
                for j in range(3):           
                    s.append(P[k+j][i+cnt])  
                    cnt += 1
                cnt = 0    
                print(s)
                if s == A:
                    suma += 1
                s = []
    s = []
      
    print(suma)               

###################################################################################################                         

# Diagonial Check!  Right to Left OK!!!         
    
    if x > 2 and y > 2:                      # για x=4 τότε k==0 , k==1
        for k in range(x-2):
            cnt = 0                  
            for i in range(-1,-y+1,-1):      # για y=6 τότε i==-1, i==-2, i==-3, i==-4.
                for j in range(3):           
                    s.append(P[k+j][i-cnt])  
                    cnt -= -1
                cnt = 0    
                print(s)
                if s == A:
                    suma += 1
                s = []
      
    print(suma)            

##################################################################################################

ms = suma/t
z = f"Ο μέσος όρος των τριάδων SOS, είναι : {ms}" 
print (z)
